//-слэш - разрез /слэш в гору \слэш с горы
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов


// способности
// получить данные о давлениеvoid dav(){}
void dav(){}
// показать давления
long pokasDav(){}
// проверить кнопку
long proverKnop(){}
// показать заряд аккумулятор
long pokasRadAkkm(){}

void setup() {  
    int  s=0;

}

void loop() {
 //Переход Триггеры 
  
  
  
  
  //Состояния
 //1. ждет
  if  (s==1)  { 
  }
 //2. раотает 
  if (s==2)  {
  }
 //3. разряжен  
  if  (s==3) {
    
  }
}
 

 